Перем мСообщенияЛога;
Перем УровеньЛогаДляСпособаВывода;

Функция ПолучитьСообщения() Экспорт
	Возврат мСообщенияЛога;
КонецФункции

////////////////////////////
// Методы аппендера

Процедура Вывести(Знач Сообщение, Знач УровеньСообщения) Экспорт
	мСообщенияЛога.Добавить(Сообщение);
КонецПроцедуры

Процедура Закрыть() Экспорт
	мСообщенияЛога = Неопределено;
КонецПроцедуры

Функция Уровень() Экспорт
	Возврат УровеньЛогаДляСпособаВывода;	
КонецФункции

Процедура УстановитьУровень(НовыйУровень) Экспорт
	УровеньЛогаДляСпособаВывода = НовыйУровень;
КонецПроцедуры

мСообщенияЛога = Новый Массив;
УровеньЛогаДляСпособаВывода = УровниЛога.Информация;
